trunk/src/QLThoiKhoaBieu/src/jbiasa/QLThoiKhoaBieu.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="QLThoiKhoaBieu"
             xmlns:tns="QLThoiKhoaBieu" xmlns:ns="http://j2ee.netbeans.org/wsdl/QuanLyThoiKhoaBieu/ThemTKB" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://j2ee.netbeans.org/wsdl/QuanLyThoiKhoaBieu/XemTKB">
    <import namespace="http://j2ee.netbeans.org/wsdl/QuanLyThoiKhoaBieu/ThemTKB" location="../jbiServiceUnits/QuanLyThoiKhoaBieu/interface_WSDL/ThemTKB.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/QuanLyThoiKhoaBieu/XemTKB" location="../jbiServiceUnits/QuanLyThoiKhoaBieu/interface_WSDL/XemTKB.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="tns:dummyCasaPortType"/>
    <binding name="casaBinding2" type="ns:ThemTKBPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ThemTKBOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="QLThoiKhoaBieu"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="QLThoiKhoaBieu"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding3" type="ns1:XemTKBPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="XemTKBOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="QLThoiKhoaBieu"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="QLThoiKhoaBieu"/>
            </output>
        </operation>
    </binding>
    <service name="QLThoiKhoaBieuService1">
        <port name="casaPort1" binding="tns:casaBinding1"/>
    </service>
    <service name="QLThoiKhoaBieuService2">
        <port name="ThemTKB" binding="tns:casaBinding2">
            <soap:address location="http://localhost:${HttpDefaultPort}/QLThoiKhoaBieuService2/ThemTKB"/>
        </port>
    </service>
    <service name="QLThoiKhoaBieuService3">
        <port name="XemTKB" binding="tns:casaBinding3">
            <soap:address location="http://localhost:${HttpDefaultPort}/QLThoiKhoaBieuService3/XemTKB"/>
        </port>
    </service>
</definitions>


