src/QLThoiKhoaBieu/test/TestCase4/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlt="QLThoiKhoaBieu">
  <soapenv:Body>
    <qlt:XemTKBOperation>
      <tenlop>10a1</tenlop>
      <hocky>1</hocky>
    </qlt:XemTKBOperation>
  </soapenv:Body>
</soapenv:Envelope>