src/QLThoiKhoaBieu/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlt="QLThoiKhoaBieu" xmlns:esc="http://xml.netbeans.org/schema/EschoolinkObject">
  <soapenv:Body>
    <qlt:ThemTKBOperation>
      <thoiKhoaBieu>
        <esc:idThoiKhoaBieu>111</esc:idThoiKhoaBieu>
        <esc:idLop>1</esc:idLop>
        <esc:idNamHoc>1</esc:idNamHoc>
        <esc:hocKy>2</esc:hocKy>
        <!--Zero or more repetitions:-->
        <esc:ChiTietThoiKhoaBieu>
          <esc:id_chitietthoikhoabieu>222</esc:id_chitietthoikhoabieu>
          <esc:id_giaovien>1</esc:id_giaovien>
          <esc:id_monhoc>1</esc:id_monhoc>
          <esc:sotiet>3</esc:sotiet>
          <esc:thu>2</esc:thu>
          <esc:tietThuMay>3</esc:tietThuMay>
        </esc:ChiTietThoiKhoaBieu>
      </thoiKhoaBieu>
    </qlt:ThemTKBOperation>
  </soapenv:Body>
</soapenv:Envelope>